biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
/******************************************************************************
 * <combinewith CN0_PULLUP_ENABLE, CN1_PULLUP_ENABLE, CN2_PULLUP_ENABLE, CN3_PULLUP_ENABLE,
 *  CN4_PULLUP_ENABLE, CN5_PULLUP_ENABLE, CN6_PULLUP_ENABLE, CN7_PULLUP_ENABLE, CN8_PULLUP_ENABLE,
 *  CN9_PULLUP_ENABLE, CN10_PULLUP_ENABLE, CN11_PULLUP_ENABLE, CN12_PULLUP_ENABLE, CN13_PULLUP_ENABLE,
 *  CN14_PULLUP_ENABLE, CN15_PULLUP_ENABLE, CN16_PULLUP_ENABLE, CN17_PULLUP_ENABLE, CN18_PULLUP_ENABLE,
 *  CN19_PULLUP_ENABLE, CN20_PULLUP_ENABLE, CN_PULLUP_DISABLE_ALL>
 *
 * Parameter values to be used with ConfigCNPullups()
 *****************************************************************************/
#if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define CNA10_PULLUP_ENABLE                 (1 << _CNPUA_CNPUA10_POSITION)
#define CNA9_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA9_POSITION)
#define CNA8_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA8_POSITION)
#define CNA7_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA7_POSITION)
#define CNA4_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA4_POSITION)
#define CNA3_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA3_POSITION)
#define CNA2_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA2_POSITION)
#define CNA1_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA1_POSITION)
#define CNA0_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA0_POSITION)
#define CNA_PULLUP_DISABLE_ALL       		(0)             /* Default */

#define CNB15_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB15_POSITION)
#define CNB14_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB14_POSITION)
#define CNB13_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB13_POSITION)
#define CNB12_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB12_POSITION) 
#define CNB11_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB11_POSITION) 
#define CNB10_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB10_POSITION)
#define CNB9_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB9_POSITION)
#define CNB8_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB8_POSITION)
#define CNB7_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB7_POSITION)
#define CNB6_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB6_POSITION)
#define CNB5_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB5_POSITION)
#define CNB4_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB4_POSITION)
#define CNB3_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB3_POSITION)
#define CNB2_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB2_POSITION)
#define CNB1_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB1_POSITION)
#define CNB0_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB0_POSITION)
#define CNB_PULLUP_DISABLE_ALL       		(0)             /* Default */

#define CNC9_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC9_POSITION)
#define CNC8_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC8_POSITION)
#define CNC7_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC7_POSITION)
#define CNC6_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC6_POSITION)
#define CNC5_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC5_POSITION)
#define CNC4_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC4_POSITION)
#define CNC3_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC3_POSITION)
#define CNC2_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC2_POSITION)
#define CNC1_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC1_POSITION)
#define CNC0_PULLUP_ENABLE                  (1 << _CNPUC_CNPUC0_POSITION) 
#define CNC_PULLUP_DISABLE_ALL       		(0)             /* Default */

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define CNA15_PULLUP_ENABLE                 (1 << _CNPUA_CNPUA15_POSITION)
#define CNA14_PULLUP_ENABLE                 (1 << _CNPUA_CNPUA14_POSITION)
#define CNA10_PULLUP_ENABLE                 (1 << _CNPUA_CNPUA10_POSITION)
#define CNA9_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA9_POSITION)
#define CNA7_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA7_POSITION)
#define CNA6_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA6_POSITION)
#define CNA5_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA5_POSITION)
#define CNA4_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA4_POSITION)
#define CNA3_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA3_POSITION)
#define CNA2_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA2_POSITION)
#define CNA1_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA1_POSITION)
#define CNA0_PULLUP_ENABLE                  (1 << _CNPUA_CNPUA0_POSITION)
#define CNA_PULLUP_DISABLE_ALL              (0)             /* Default */

#define CNB15_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB15_POSITION)
#define CNB14_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB14_POSITION)
#define CNB13_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB13_POSITION)
#define CNB12_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB12_POSITION)
#define CNB11_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB11_POSITION)
#define CNB10_PULLUP_ENABLE                 (1 << _CNPUB_CNPUB10_POSITION)
#define CNB9_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB9_POSITION)
#define CNB8_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB8_POSITION)
#define CNB7_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB7_POSITION)
#define CNB6_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB6_POSITION)
#define CNB5_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB5_POSITION)
#define CNB4_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB4_POSITION)
#define CNB3_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB3_POSITION)
#define CNB2_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB2_POSITION)
#define CNB1_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB1_POSITION)
#define CNB0_PULLUP_ENABLE                  (1 << _CNPUB_CNPUB0_POSITION)
#define CNB_PULLUP_DISABLE_ALL       		(0)             /* Default */

