biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#define CNC15_PULLUP_ENABLE                 (1 << _CNPUC_CNPUC15_POSITION)
#define CNC14_PULLUP_ENABLE                 (1 << _CNPUC_CNPUC14_POSITION)
#define CNC13_PULLUP_ENABLE                 (1 << _CNPUC_CNPUC13_POSITION)
#define CNC12_PULLUP_ENABLE                 (1 << _CNPUC_CNPUC12_POSITION)
#define CNC_PULLUP_DISABLE_ALL              (0)             /* Default */

#define CND15_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD15_POSITION)
#define CND14_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD14_POSITION)
#define CND13_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD13_POSITION)
#define CND12_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD12_POSITION)
#define CND11_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD11_POSITION)
#define CND10_PULLUP_ENABLE                 (1 << _CNPUD_CNPUD10_POSITION)
#define CND9_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD9_POSITION)
#define CND8_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD8_POSITION)
#define CND7_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD7_POSITION)
#define CND6_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD6_POSITION)
#define CND5_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD5_POSITION)
#define CND4_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD4_POSITION)
#define CND3_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD3_POSITION)
#define CND2_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD2_POSITION)
#define CND1_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD1_POSITION)
#define CND0_PULLUP_ENABLE                  (1 << _CNPUD_CNPUD0_POSITION)
#define CND_PULLUP_DISABLE_ALL              (0)             /* Default */

#define CNE9_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE9_POSITION)
#define CNE8_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE8_POSITION)
#define CNE7_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE7_POSITION)
#define CNE6_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE6_POSITION)
#define CNE5_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE5_POSITION)
#define CNE4_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE4_POSITION)
#define CNE3_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE3_POSITION)
#define CNE2_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE2_POSITION)
#define CNE1_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE1_POSITION)
#define CNE0_PULLUP_ENABLE                  (1 << _CNPUE_CNPUE0_POSITION)
#define CNE_PULLUP_DISABLE_ALL              (0)             /* Default */

#define CNF13_PULLUP_ENABLE                 (1 << _CNPUF_CNPUF13_POSITION)
#define CNF12_PULLUP_ENABLE                 (1 << _CNPUF_CNPUF12_POSITION)
#define CNF8_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF8_POSITION)
#define CNF7_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF7_POSITION)
#define CNF6_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF6_POSITION)
#define CNF5_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF5_POSITION)
#define CNF4_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF4_POSITION)
#define CNF3_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF3_POSITION)
#define CNF2_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF2_POSITION)
#define CNF1_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF1_POSITION)
#define CNF0_PULLUP_ENABLE                  (1 << _CNPUF_CNPUF0_POSITION)
#define CNF_PULLUP_DISABLE_ALL              (0)             /* Default */

#define CNG9_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG9_POSITION)
#define CNG8_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG8_POSITION)
#define CNG7_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG7_POSITION)
#define CNG6_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG6_POSITION)
#define CNG3_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG3_POSITION)
#define CNG2_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG2_POSITION)
#define CNG1_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG1_POSITION)
#define CNG0_PULLUP_ENABLE                  (1 << _CNPUG_CNPUG0_POSITION)
#define CNG_PULLUP_DISABLE_ALL              (0)             /* Default */

#else 
#define CN21_PULLUP_ENABLE          (1 << _CNPUE_CNPUE21_POSITION)
#define CN20_PULLUP_ENABLE          (1 << _CNPUE_CNPUE20_POSITION)
#define CN19_PULLUP_ENABLE          (1 << _CNPUE_CNPUE19_POSITION)
#define CN18_PULLUP_ENABLE          (1 << _CNPUE_CNPUE18_POSITION)
#define CN17_PULLUP_ENABLE          (1 << _CNPUE_CNPUE17_POSITION)
#define CN16_PULLUP_ENABLE          (1 << _CNPUE_CNPUE16_POSITION)
#define CN15_PULLUP_ENABLE          (1 << _CNPUE_CNPUE15_POSITION)
#define CN14_PULLUP_ENABLE          (1 << _CNPUE_CNPUE14_POSITION)
#define CN13_PULLUP_ENABLE          (1 << _CNPUE_CNPUE13_POSITION)
#define CN12_PULLUP_ENABLE          (1 << _CNPUE_CNPUE12_POSITION)
#define CN11_PULLUP_ENABLE          (1 << _CNPUE_CNPUE11_POSITION)
#define CN10_PULLUP_ENABLE          (1 << _CNPUE_CNPUE10_POSITION)
#define CN9_PULLUP_ENABLE           (1 << _CNPUE_CNPUE9_POSITION)
#define CN8_PULLUP_ENABLE           (1 << _CNPUE_CNPUE8_POSITION)
#define CN7_PULLUP_ENABLE           (1 << _CNPUE_CNPUE7_POSITION)
#define CN6_PULLUP_ENABLE           (1 << _CNPUE_CNPUE6_POSITION)
#define CN5_PULLUP_ENABLE           (1 << _CNPUE_CNPUE5_POSITION)
#define CN4_PULLUP_ENABLE           (1 << _CNPUE_CNPUE4_POSITION)
#define CN3_PULLUP_ENABLE           (1 << _CNPUE_CNPUE3_POSITION)
#define CN2_PULLUP_ENABLE           (1 << _CNPUE_CNPUE2_POSITION)
#define CN1_PULLUP_ENABLE           (1 << _CNPUE_CNPUE1_POSITION)
#define CN0_PULLUP_ENABLE           (1 << _CNPUE_CNPUE0_POSITION)
#define CN_PULLUP_DISABLE_ALL       (0)             /* Default */

#endif
/******************************************************************************
 * Change Notice Pullup Enable Control Function
 *
 * Function:        void ConfigCNPullups(unsigned int config)
 *
 * Description:     Configures Change Notice pull-ups
 *
 * PreCondition:    None
 *
 * Inputs:          Bit-wise OR value of CNx_PULLUP_ENABLE sets
 *
 *                  Note: An absent symbol assumes corresponding bit(s)
 *                  are disabled, or default value, and will be set = 0.
 *
 * Output:          None
 *
 * Example:         To enable CN0 & CN1 pullups and disable all others
 *                  ConfigCNPullups(CN0_PULLUP_ENABLE | CN1_PULLUP_ENABLE)
 *
 *****************************************************************************/
 #if   ((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__)
#define ConfigCNAPullups(config)     CNPUA = config
#define ConfigCNBPullups(config)     CNPUB = config
#define ConfigCNCPullups(config)     CNPUC = config

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define ConfigCNAPullups(config)     CNPUA = config
#define ConfigCNBPullups(config)     CNPUB = config
#define ConfigCNCPullups(config)     CNPUC = config
#define ConfigCNDPullups(config)     CNPUD = config
#define ConfigCNEPullups(config)     CNPUE = config
#define ConfigCNFPullups(config)     CNPUF = config
#define ConfigCNGPullups(config)     CNPUG = config

#else
#define ConfigCNPullups(config)     CNPUE = config

#endif
/******************************************************************************
 * Parameter values to be used with mCNOpen()
 *****************************************************************************/
#if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define CNA_ON                           (1 << _CNCONA_ON_POSITION)     /* CN ON */
#define CNA_OFF                          (0)  /* CN OFF */

