biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#define CNA_FRZ_ON                       (1 << _CNCONA_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNA_FRZ_OFF                      (0) //Freeze off

#define CNA_IDLE_CON                     (1 << _CNCONA_SIDL_POSITION)     /* operate during idle */
#define CNA_IDLE_STOP                    (0) // stop during idle

#define CNB_ON                           (1 << _CNCONB_ON_POSITION)     /* CN ON */
#define CNB_OFF                          (0)  /* CN OFF */

#define CNB_FRZ_ON                       (1 << _CNCONB_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNB_FRZ_OFF                      (0) //Freeze off

#define CNB_IDLE_CON                     (1 << _CNCONB_SIDL_POSITION)     /* operate during idle */
#define CNB_IDLE_STOP                    (0) // stop during idle

#define CNC_ON                           (1 << _CNCONC_ON_POSITION)     /* CN ON */
#define CNC_OFF                          (0)  /* CN OFF */

#define CNC_FRZ_ON                       (1 << _CNCONC_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNC_FRZ_OFF                      (0) //Freeze off

#define CNC_IDLE_CON                     (1 << _CNCONC_SIDL_POSITION)     /* operate during idle */
#define CNC_IDLE_STOP                    (0) // stop during idle

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define CNA_ON                           (1 << _CNCONA_ON_POSITION)     /* CN ON */
#define CNA_OFF                          (0)  /* CN OFF */

#define CNA_FRZ_ON                       (1 << _CNCONA_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNA_FRZ_OFF                      (0) //Freeze off

#define CNA_IDLE_CON                     (1 << _CNCONA_SIDL_POSITION)     /* operate during idle */
#define CNA_IDLE_STOP                    (0) // stop during idle

#define CNB_ON                           (1 << _CNCONB_ON_POSITION)     /* CN ON */
#define CNB_OFF                          (0)  /* CN OFF */

#define CNB_FRZ_ON                       (1 << _CNCONB_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNB_FRZ_OFF                      (0) //Freeze off

#define CNB_IDLE_CON                     (1 << _CNCONB_SIDL_POSITION)     /* operate during idle */
#define CNB_IDLE_STOP                    (0) // stop during idle

#define CNC_ON                           (1 << _CNCONC_ON_POSITION)     /* CN ON */
#define CNC_OFF                          (0)  /* CN OFF */

#define CNC_FRZ_ON                       (1 << _CNCONC_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CNC_FRZ_OFF                      (0) //Freeze off

#define CNC_IDLE_CON                     (1 << _CNCONC_SIDL_POSITION)     /* operate during idle */
#define CNC_IDLE_STOP                    (0) // stop during idle

#define CND_ON                           (1 << _CNCOND_ON_POSITION)     /* CN ON */
#define CND_OFF                          (0)  /* CN OFF */

#define CND_IDLE_CON                     (1 << _CNCOND_SIDL_POSITION)     /* operate during idle */
#define CND_IDLE_STOP                    (0) // stop during idle

#define CNE_ON                           (1 << _CNCONE_ON_POSITION)     /* CN ON */
#define CNE_OFF                          (0)  /* CN OFF */

#define CNE_IDLE_CON                     (1 << _CNCONE_SIDL_POSITION)     /* operate during idle */
#define CNE_IDLE_STOP                    (0) // stop during idle

#define CNF_ON                           (1 << _CNCONF_ON_POSITION)     /* CN ON */
#define CNF_OFF                          (0)  /* CN OFF */

#define CNF_IDLE_CON                     (1 << _CNCONF_SIDL_POSITION)     /* operate during idle */
#define CNF_IDLE_STOP                    (0) // stop during idle

#define CNG_ON                           (1 << _CNCONG_ON_POSITION)     /* CN ON */
#define CNG_OFF                          (0)  /* CN OFF */

#define CNG_IDLE_CON                     (1 << _CNCONG_SIDL_POSITION)     /* operate during idle */
#define CNG_IDLE_STOP                    (0) // stop during idle

#else
#define CN_ON                           (1 << _CNCON_ON_POSITION)     /* CN ON */
#define CN_OFF                          (0)  /* CN OFF */

#define CN_FRZ_ON                       (1 << _CNCON_FRZ_POSITION)    /* Freeze timer on debug halt */
#define CN_FRZ_OFF                      (0) //Freeze off

#define CN_IDLE_CON                     (1 << _CNCON_SIDL_POSITION)     /* operate during idle */
#define CN_IDLE_STOP                    (0) // stop during idle

#endif

/******************************************************************
 * <combinewith CN0_ENABLE, CN1_ENABLE, CN2_ENABLE, CN3_ENABLE,
 * CN4_ENABLE, CN5_ENABLE, CN6_ENABLE, CN7_ENABLE, CN8_ENABLE,
 * CN9_ENABLE, CN10_ENABLE, CN11_ENABLE, CN12_ENABLE, CN13_ENABLE,
 * CN14_ENABLE, CN15_ENABLE, CN16_ENABLE, CN17_ENABLE, CN18_ENABLE,
 * CN19_ENABLE, CN20_ENABLE, CN_DISABLE_ALL>
 *
 * Change notice enable flags
 *******************************************************************/
 #if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define CNA10_ENABLE                 (1 << _CNENA_CNIEA10_POSITION)
#define CNA9_ENABLE                  (1 << _CNENA_CNIEA9_POSITION)
#define CNA8_ENABLE                  (1 << _CNENA_CNIEA8_POSITION)
#define CNA7_ENABLE                  (1 << _CNENA_CNIEA7_POSITION)
#define CNA4_ENABLE                  (1 << _CNENA_CNIEA4_POSITION)
#define CNA3_ENABLE                  (1 << _CNENA_CNIEA3_POSITION)
#define CNA2_ENABLE                  (1 << _CNENA_CNIEA2_POSITION)
#define CNA1_ENABLE                  (1 << _CNENA_CNIEA1_POSITION)
#define CNA0_ENABLE                  (1 << _CNENA_CNIEA0_POSITION)
#define CNA_DISABLE_ALL              (0)             /* Default */

#define CNB15_ENABLE                 (1 << _CNENB_CNIEB15_POSITION)
#define CNB14_ENABLE                 (1 << _CNENB_CNIEB14_POSITION)
#define CNB13_ENABLE                 (1 << _CNENB_CNIEB13_POSITION)
#define CNB12_ENABLE                 (1 << _CNENB_CNIEB12_POSITION) 
#define CNB11_ENABLE                 (1 << _CNENB_CNIEB11_POSITION) 
#define CNB10_ENABLE                 (1 << _CNENB_CNIEB10_POSITION)
#define CNB9_ENABLE                  (1 << _CNENB_CNIEB9_POSITION)
#define CNB8_ENABLE                  (1 << _CNENB_CNIEB8_POSITION)
#define CNB7_ENABLE                  (1 << _CNENB_CNIEB7_POSITION)
#define CNB6_ENABLE                  (1 << _CNENB_CNIEB6_POSITION)
#define CNB5_ENABLE                  (1 << _CNENB_CNIEB5_POSITION)
#define CNB4_ENABLE                  (1 << _CNENB_CNIEB4_POSITION)
#define CNB3_ENABLE                  (1 << _CNENB_CNIEB3_POSITION)
#define CNB2_ENABLE                  (1 << _CNENB_CNIEB2_POSITION)
#define CNB1_ENABLE                  (1 << _CNENB_CNIEB1_POSITION)
#define CNB0_ENABLE                  (1 << _CNENB_CNIEB0_POSITION)
#define CNB_DISABLE_ALL              (0)             /* Default */

#define CNC9_ENABLE                  (1 << _CNENC_CNIEC9_POSITION)
#define CNC8_ENABLE                  (1 << _CNENC_CNIEC8_POSITION)
#define CNC7_ENABLE                  (1 << _CNENC_CNIEC7_POSITION)
#define CNC6_ENABLE                  (1 << _CNENC_CNIEC6_POSITION)
#define CNC5_ENABLE                  (1 << _CNENC_CNIEC5_POSITION)
#define CNC4_ENABLE                  (1 << _CNENC_CNIEC4_POSITION)
#define CNC3_ENABLE                  (1 << _CNENC_CNIEC3_POSITION)
#define CNC2_ENABLE                  (1 << _CNENC_CNIEC2_POSITION)
#define CNC1_ENABLE                  (1 << _CNENC_CNIEC1_POSITION)
#define CNC0_ENABLE                  (1 << _CNENC_CNIEC0_POSITION)
#define CNC_DISABLE_ALL              (0)             /* Default */

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define CNA15_ENABLE                 (1 << _CNENA_CNIEA15_POSITION)
#define CNA14_ENABLE                 (1 << _CNENA_CNIEA14_POSITION)
#define CNA10_ENABLE                 (1 << _CNENA_CNIEA10_POSITION)
#define CNA9_ENABLE                  (1 << _CNENA_CNIEA9_POSITION)
#define CNA7_ENABLE                  (1 << _CNENA_CNIEA7_POSITION)
#define CNA6_ENABLE                  (1 << _CNENA_CNIEA6_POSITION)
#define CNA5_ENABLE                  (1 << _CNENA_CNIEA5_POSITION)
#define CNA4_ENABLE                  (1 << _CNENA_CNIEA4_POSITION)
#define CNA3_ENABLE                  (1 << _CNENA_CNIEA3_POSITION)
#define CNA2_ENABLE                  (1 << _CNENA_CNIEA2_POSITION)
#define CNA1_ENABLE                  (1 << _CNENA_CNIEA1_POSITION)
#define CNA0_ENABLE                  (1 << _CNENA_CNIEA0_POSITION)
#define CNA_DISABLE_ALL              (0)             /* Default */

#define CNB15_ENABLE                 (1 << _CNENB_CNIEB15_POSITION)
#define CNB14_ENABLE                 (1 << _CNENB_CNIEB14_POSITION)
#define CNB13_ENABLE                 (1 << _CNENB_CNIEB13_POSITION)
#define CNB12_ENABLE                 (1 << _CNENB_CNIEB12_POSITION)
#define CNB11_ENABLE                 (1 << _CNENB_CNIEB11_POSITION)
#define CNB10_ENABLE                 (1 << _CNENB_CNIEB10_POSITION)
#define CNB9_ENABLE                  (1 << _CNENB_CNIEB9_POSITION)
#define CNB8_ENABLE                  (1 << _CNENB_CNIEB8_POSITION)
#define CNB7_ENABLE                  (1 << _CNENB_CNIEB7_POSITION)
#define CNB6_ENABLE                  (1 << _CNENB_CNIEB6_POSITION)
#define CNB5_ENABLE                  (1 << _CNENB_CNIEB5_POSITION)
#define CNB4_ENABLE                  (1 << _CNENB_CNIEB4_POSITION)
#define CNB3_ENABLE                  (1 << _CNENB_CNIEB3_POSITION)
#define CNB2_ENABLE                  (1 << _CNENB_CNIEB2_POSITION)
#define CNB1_ENABLE                  (1 << _CNENB_CNIEB1_POSITION)
#define CNB0_ENABLE                  (1 << _CNENB_CNIEB0_POSITION)
#define CNB_DISABLE_ALL              (0)             /* Default */

#define CNC15_ENABLE                 (1 << _CNENC_CNIEC15_POSITION)
#define CNC14_ENABLE                 (1 << _CNENC_CNIEC14_POSITION)
#define CNC13_ENABLE                 (1 << _CNENC_CNIEC13_POSITION)
#define CNC12_ENABLE                 (1 << _CNENC_CNIEC12_POSITION)
#define CNC4_ENABLE                  (1 << _CNENC_CNIEC4_POSITION)
#define CNC3_ENABLE                  (1 << _CNENC_CNIEC3_POSITION)
#define CNC2_ENABLE                  (1 << _CNENC_CNIEC2_POSITION)
#define CNC1_ENABLE                  (1 << _CNENC_CNIEC1_POSITION)
#define CNC_DISABLE_ALL              (0)             /* Default */

