biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#define CND15_ENABLE                 (1 << _CNEND_CNIED15_POSITION)
#define CND14_ENABLE                 (1 << _CNEND_CNIED14_POSITION)
#define CND13_ENABLE                 (1 << _CNEND_CNIED13_POSITION)
#define CND12_ENABLE                 (1 << _CNEND_CNIED12_POSITION)
#define CND11_ENABLE                 (1 << _CNEND_CNIED11_POSITION)
#define CND10_ENABLE                 (1 << _CNEND_CNIED10_POSITION)
#define CND9_ENABLE                  (1 << _CNEND_CNIED9_POSITION)
#define CND8_ENABLE                  (1 << _CNEND_CNIED8_POSITION)
#define CND7_ENABLE                  (1 << _CNEND_CNIED7_POSITION)
#define CND6_ENABLE                  (1 << _CNEND_CNIED6_POSITION)
#define CND5_ENABLE                  (1 << _CNEND_CNIED5_POSITION)
#define CND4_ENABLE                  (1 << _CNEND_CNIED4_POSITION)
#define CND3_ENABLE                  (1 << _CNEND_CNIED3_POSITION)
#define CND2_ENABLE                  (1 << _CNEND_CNIED2_POSITION)
#define CND1_ENABLE                  (1 << _CNEND_CNIED1_POSITION)
#define CND0_ENABLE                  (1 << _CNEND_CNIED0_POSITION)
#define CND_DISABLE_ALL              (0)             /* Default */

#define CNE9_ENABLE                  (1 << _CNENE_CNIEE9_POSITION)
#define CNE8_ENABLE                  (1 << _CNENE_CNIEE8_POSITION)
#define CNE7_ENABLE                  (1 << _CNENE_CNIEE7_POSITION)
#define CNE6_ENABLE                  (1 << _CNENE_CNIEE6_POSITION)
#define CNE5_ENABLE                  (1 << _CNENE_CNIEE5_POSITION)
#define CNE4_ENABLE                  (1 << _CNENE_CNIEE4_POSITION)
#define CNE3_ENABLE                  (1 << _CNENE_CNIEE3_POSITION)
#define CNE2_ENABLE                  (1 << _CNENE_CNIEE2_POSITION)
#define CNE1_ENABLE                  (1 << _CNENE_CNIEE1_POSITION)
#define CNE0_ENABLE                  (1 << _CNENE_CNIEE0_POSITION)
#define CNE_DISABLE_ALL              (0)             /* Default */

#define CNF13_ENABLE                 (1 << _CNENF_CNIEF13_POSITION)
#define CNF12_ENABLE                 (1 << _CNENF_CNIEF12_POSITION)
#define CNF8_ENABLE                  (1 << _CNENF_CNIEF8_POSITION)
#define CNF7_ENABLE                  (1 << _CNENF_CNIEF7_POSITION)
#define CNF6_ENABLE                  (1 << _CNENF_CNIEF6_POSITION)
#define CNF5_ENABLE                  (1 << _CNENF_CNIEF5_POSITION)
#define CNF4_ENABLE                  (1 << _CNENF_CNIEF4_POSITION)
#define CNF3_ENABLE                  (1 << _CNENF_CNIEF3_POSITION)
#define CNF2_ENABLE                  (1 << _CNENF_CNIEF2_POSITION)
#define CNF1_ENABLE                  (1 << _CNENF_CNIEF1_POSITION)
#define CNF0_ENABLE                  (1 << _CNENF_CNIEF0_POSITION)
#define CNF_DISABLE_ALL              (0)             /* Default */

#define CNG9_ENABLE                  (1 << _CNENG_CNIEG9_POSITION)
#define CNG8_ENABLE                  (1 << _CNENG_CNIEG8_POSITION)
#define CNG7_ENABLE                  (1 << _CNENG_CNIEG7_POSITION)
#define CNG6_ENABLE                  (1 << _CNENG_CNIEG6_POSITION)
#define CNG3_ENABLE                  (1 << _CNENG_CNIEG3_POSITION)
#define CNG2_ENABLE                  (1 << _CNENG_CNIEG2_POSITION)
#define CNG1_ENABLE                  (1 << _CNENG_CNIEG1_POSITION)
#define CNG0_ENABLE                  (1 << _CNENG_CNIEG0_POSITION)
#define CNG_DISABLE_ALL              (0)             /* Default */
 
#else
#define CN21_ENABLE                 (1 << _CNEN_CNEN21_POSITION)
#define CN20_ENABLE                 (1 << _CNEN_CNEN20_POSITION)
#define CN19_ENABLE                 (1 << _CNEN_CNEN19_POSITION)
#define CN18_ENABLE                 (1 << _CNEN_CNEN18_POSITION)
#define CN17_ENABLE                 (1 << _CNEN_CNEN17_POSITION)
#define CN16_ENABLE                 (1 << _CNEN_CNEN16_POSITION)
#define CN15_ENABLE                 (1 << _CNEN_CNEN15_POSITION)
#define CN14_ENABLE                 (1 << _CNEN_CNEN14_POSITION)
#define CN13_ENABLE                 (1 << _CNEN_CNEN13_POSITION)
#define CN12_ENABLE                 (1 << _CNEN_CNEN12_POSITION)
#define CN11_ENABLE                 (1 << _CNEN_CNEN11_POSITION)
#define CN10_ENABLE                 (1 << _CNEN_CNEN10_POSITION)
#define CN9_ENABLE                  (1 << _CNEN_CNEN9_POSITION)
#define CN8_ENABLE                  (1 << _CNEN_CNEN8_POSITION)
#define CN7_ENABLE                  (1 << _CNEN_CNEN7_POSITION)
#define CN6_ENABLE                  (1 << _CNEN_CNEN6_POSITION)
#define CN5_ENABLE                  (1 << _CNEN_CNEN5_POSITION)
#define CN4_ENABLE                  (1 << _CNEN_CNEN4_POSITION)
#define CN3_ENABLE                  (1 << _CNEN_CNEN3_POSITION)
#define CN2_ENABLE                  (1 << _CNEN_CNEN2_POSITION)
#define CN1_ENABLE                  (1 << _CNEN_CNEN1_POSITION)
#define CN0_ENABLE                  (1 << _CNEN_CNEN0_POSITION)
#define CN_DISABLE_ALL              (0)             /* Default */

#endif

/******************************************************************************
 * Change Notice Open Control Function
 *
 * Function:        void mCNOpen(unsigned int control, unsigned int pins, unsigned int pullup)
 *
 * Description:     Configures Change Notice interrupt, enables specified
 *                  change notice inputs and pullups and configures the CNCON register.
 *                  Attention: This function does not enable the CN interrupt nor its priorities.
 *                  The user should use macro ConfigIntCN to enable the CN interrupt and set the
 *                  desired priorities only after reading the corresponding ports.
 *                  See Notes below.
 *
 * PreCondition:    None
 *
 * Inputs:          Bit-wise OR value of CNx_ENABLE sets
 *
 *                  Note: An absent symbol assumes corresponding bit(s)
 *                  are disabled, or default value, and will be set = 0.
 *
 * Output:          None
 *
* Example:          Enable the change notice module, select pins CN0 & CN1 and enable
 *                  corresponding weak pull-ups.
 *                  mCNOpen(CN_ON | CN_IDLE_CON, CN0_ENABLE | CN1_ENABLE,
 *                  CN0_PULLUP_ENABLE | CN1_PULLUP_ENABLE)
 *
 * Notes:           It is recommended to disable vector interrupts prior to configuring
 *                  the change notice module and to use the following sequence to
 *                  prevent spurious change notice interrupts during configuration:
 *
 *                  1. setup the change notice module, pins and optional pullups
 *                  mCNOpen(control, pins, pullups).
 *
 *                  2. read every port that has a corresponding enabled change notice pins
 *                  var = mPORTARead;
 *                  var = PORTBRead;
 *                  ...
 *
 *                  3. setup the change notice interrupts
 *                  ConfigIntCN(interrupt).
 *
 *****************************************************************************/
#if (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define mCNAOpen(configA, pinsA, pullupsA)\
        (CNCONACLR = 0xFFFF, CNCONASET = ((configA) | CNA_ON), CNENA = (pinsA), CNPUA = (pullupsA))
#define mCNBOpen(configB, pinsB, pullupsB)\
        (CNCONBCLR = 0xFFFF, CNCONBSET = ((configB) | CNB_ON), CNENB = (pinsB), CNPUB = (pullupsB))
#define mCNCOpen(configC, pinsC, pullupsC)\
        (CNCONCCLR = 0xFFFF, CNCONCSET = ((configC) | CNC_ON), CNENC = (pinsC), CNPUC = (pullupsC))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define mCNAOpen(configA, pinsA, pullupsA)\
        (CNCONACLR = 0xFFFF, CNCONASET = ((configA) | CNA_ON), CNENA = (pinsA), CNPUA = (pullupsA))
#define mCNBOpen(configB, pinsB, pullupsB)\
        (CNCONBCLR = 0xFFFF, CNCONBSET = ((configB) | CNB_ON), CNENB = (pinsB), CNPUB = (pullupsB))
#define mCNCOpen(configC, pinsC, pullupsC)\
        (CNCONCCLR = 0xFFFF, CNCONCSET = ((configC) | CNC_ON), CNENC = (pinsC), CNPUC = (pullupsC))
#define mCNDOpen(configD, pinsD, pullupsD)\
        (CNCONDCLR = 0xFFFF, CNCONDSET = ((configD) | CND_ON), CNEND = (pinsD), CNPUD = (pullupsD))
#define mCNEOpen(configE, pinsE, pullupsE)\
        (CNCONECLR = 0xFFFF, CNCONESET = ((configE) | CNE_ON), CNENE = (pinsE), CNPUE = (pullupsE))
#define mCNFOpen(configF, pinsF, pullupsF)\
        (CNCONFCLR = 0xFFFF, CNCONFSET = ((configF) | CNF_ON), CNENF = (pinsF), CNPUF = (pullupsF))
#define mCNGOpen(configG, pinsG, pullupsG)\
        (CNCONGCLR = 0xFFFF, CNCONGSET = ((configG) | CNG_ON), CNENG = (pinsG), CNPUG = (pullupsG))

#else
#define mCNOpen(config, pins, pullups)\
        (CNCONCLR = 0xFFFF, CNCONSET = ((config) | CN_ON), CNEN = (pins), CNPUE = (pullups))
#endif

