biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
/******************************************************************************
 * Change Notice Close Control Function
 *
 * Function:        void mCNClose(void)
 *
 * Description:     Disables Change Notice interrupt, disables all
 *                  change notice inputs and pullups
 *
 * PreCondition:    None
 *
 * Inputs:          None
 *
 * Output:          None
 *
 * Example:         mCNClose();
 *
 *****************************************************************************/
#if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define mCNAClose() (mCNAClearIntFlag(), mCNAIntEnable(0), CNCONACLR = (1 << 15),\
                    CNENA = 0, CNPUA = 0)
#define mCNBClose() (mCNBClearIntFlag(), mCNBIntEnable(0), CNCONBCLR = (1 << 15),\
                    CNENB = 0, CNPUB = 0)
#define mCNCClose() (mCNCClearIntFlag(), mCNCIntEnable(0), CNCONCCLR = (1 << 15),\
                    CNENC = 0, CNPUC = 0)

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define mCNAClose() (mCNAClearIntFlag(), mCNAIntEnable(0), CNCONACLR = (1 << 15),\
                    CNENA = 0, CNPUA = 0)
#define mCNBClose() (mCNBClearIntFlag(), mCNBIntEnable(0), CNCONBCLR = (1 << 15),\
                    CNENB = 0, CNPUB = 0)
#define mCNCClose() (mCNCClearIntFlag(), mCNCIntEnable(0), CNCONCCLR = (1 << 15),\
                    CNENC = 0, CNPUC = 0)
#define mCNDClose() (mCNDClearIntFlag(), mCNDIntEnable(0), CNCONDCLR = (1 << 15),\
                    CNEND = 0, CNPUD = 0)
#define mCNEClose() (mCNEClearIntFlag(), mCNEIntEnable(0), CNCONECLR = (1 << 15),\
                    CNENE = 0, CNPUE = 0)
#define mCNFClose() (mCNFClearIntFlag(), mCNFIntEnable(0), CNCONFCLR = (1 << 15),\
                    CNENF = 0, CNPUF = 0)
#define mCNGClose() (mCNGClearIntFlag(), mCNGIntEnable(0), CNCONGCLR = (1 << 15),\
                    CNENG = 0, CNPUG = 0)

#else
#define mCNClose() (mCNClearIntFlag(), mCNIntEnable(0), CNCONCLR = (1 << 15),\
                    CNEN = 0, CNPUE = 0)
#endif

/******************************************************************************
 * Change Notice Enable Interrupt Control Function
 *
 * Function:        void mCNEnable(void)
 *
 * Description:     Enables/Disables Change Notice Interrupt
 *
 * PreCondition:    Assumes Change Notice interrupt priorities have already been
 *                  set as well as the individual CN inputs
 *
 * Inputs:          CHANGE_INT_ON, CHANGE_INT_OFF
 *
 * Output:          None
 *
 * Example:         mCNEnable(CHANGE_INT_ON);
 *
 *****************************************************************************/
#if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define mCNAEnable(config) (mCNAIntEnable((config) >> 23))
#define mCNBEnable(config) (mCNBIntEnable((config) >> 23))
#define mCNCEnable(config) (mCNCIntEnable((config) >> 23))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define mCNAEnable(config) (mCNAIntEnable((config) >> 23))
#define mCNBEnable(config) (mCNBIntEnable((config) >> 23))
#define mCNCEnable(config) (mCNCIntEnable((config) >> 23))
#define mCNDEnable(config) (mCNDIntEnable((config) >> 23))
#define mCNEEnable(config) (mCNEIntEnable((config) >> 23))
#define mCNFEnable(config) (mCNFIntEnable((config) >> 23))
#define mCNGEnable(config) (mCNGIntEnable((config) >> 23))

#else
#define mCNEnable(config) (mCNIntEnable((config) >> 23))

#endif

/******************************************************************************
 * <combinewith EnableCN0, EnableCN1, EnableCN2, EnableCN3, EnableCN4, EnableCN5,
 * EnableCN6, EnableCN7, EnableCN8, EnableCN9, EnableCN10, EnableCN11, EnableCN12, EnableCN13,
 * EnableCN14, EnableCN15, EnableCN16, EnableCN17, EnableCN18, EnableCN19, EnableCN20>
 *
 * Change Notice Interrupt Control Function
 *
 * Function:        void EnableCNx(void)
 *
 * Description:     Enables individual Change Notice interrupt
 *
 * PreCondition:    None
 *
 * Inputs:          None
 *
 * Output:          None
 *
 * Example:         EnableCN0()
 *
 *****************************************************************************/
#if   (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__)) 
#define EnableCNA10                (CNENASET = (1 << _CNENA_CNIEA10_POSITION))
#define EnableCNA9                 (CNENASET = (1 << _CNENA_CNIEA9_POSITION))
#define EnableCNA8                 (CNENASET = (1 << _CNENA_CNIEA8_POSITION))
#define EnableCNA7                 (CNENASET = (1 << _CNENA_CNIEA7_POSITION))
#define EnableCNA4                 (CNENASET = (1 << _CNENA_CNIEA4_POSITION))
#define EnableCNA3                 (CNENASET = (1 << _CNENA_CNIEA3_POSITION))
#define EnableCNA2                 (CNENASET = (1 << _CNENA_CNIEA2_POSITION))
#define EnableCNA1                 (CNENASET = (1 << _CNENA_CNIEA1_POSITION))
#define EnableCNA0                 (CNENASET = (1 << _CNENA_CNIEA0_POSITION))
                                                                           
#define EnableCNB15                (CNENBSET = (1 << _CNENB_CNIEB15_POSITION))
#define EnableCNB14                (CNENBSET = (1 << _CNENB_CNIEB14_POSITION))
#define EnableCNB13                (CNENBSET = (1 << _CNENB_CNIEB13_POSITION))
#define EnableCNB12                (CNENBSET = (1 << _CNENB_CNIEB12_POSITION)) 
#define EnableCNB11                (CNENBSET = (1 << _CNENB_CNIEB11_POSITION)) 
#define EnableCNB10                (CNENBSET = (1 << _CNENB_CNIEB10_POSITION))
#define EnableCNB9                 (CNENBSET = (1 << _CNENB_CNIEB9_POSITION))
#define EnableCNB8                 (CNENBSET = (1 << _CNENB_CNIEB8_POSITION))
#define EnableCNB7                 (CNENBSET = (1 << _CNENB_CNIEB7_POSITION))
#define EnableCNB6                 (CNENBSET = (1 << _CNENB_CNIEB6_POSITION))
#define EnableCNB5                 (CNENBSET = (1 << _CNENB_CNIEB5_POSITION))
#define EnableCNB4                 (CNENBSET = (1 << _CNENB_CNIEB4_POSITION))
#define EnableCNB3                 (CNENBSET = (1 << _CNENB_CNIEB3_POSITION))
#define EnableCNB2                 (CNENBSET = (1 << _CNENB_CNIEB2_POSITION))
#define EnableCNB1                 (CNENBSET = (1 << _CNENB_CNIEB1_POSITION))
#define EnableCNB0                 (CNENBSET = (1 << _CNENB_CNIEB0_POSITION))
                                   
#define EnableCNC9                 (CNENCSET = (1 << _CNENC_CNIEC9_POSITION))
#define EnableCNC8                 (CNENCSET = (1 << _CNENC_CNIEC8_POSITION))
#define EnableCNC7                 (CNENCSET = (1 << _CNENC_CNIEC7_POSITION))
#define EnableCNC6                 (CNENCSET = (1 << _CNENC_CNIEC6_POSITION))
#define EnableCNC5                 (CNENCSET = (1 << _CNENC_CNIEC5_POSITION))
#define EnableCNC4                 (CNENCSET = (1 << _CNENC_CNIEC4_POSITION))
#define EnableCNC3                 (CNENCSET = (1 << _CNENC_CNIEC3_POSITION))
#define EnableCNC2                 (CNENCSET = (1 << _CNENC_CNIEC2_POSITION))
#define EnableCNC1                 (CNENCSET = (1 << _CNENC_CNIEC1_POSITION))
#define EnableCNC0                 (CNENCSET = (1 << _CNENC_CNIEC0_POSITION))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define EnableCNA15                (CNENASET = (1 << _CNENA_CNIEA15_POSITION))
#define EnableCNA14                (CNENASET = (1 << _CNENA_CNIEA14_POSITION))
#define EnableCNA10                (CNENASET = (1 << _CNENA_CNIEA10_POSITION))
#define EnableCNA9                 (CNENASET = (1 << _CNENA_CNIEA9_POSITION))
#define EnableCNA7                 (CNENASET = (1 << _CNENA_CNIEA7_POSITION))
#define EnableCNA6                 (CNENASET = (1 << _CNENA_CNIEA6_POSITION))
#define EnableCNA5                 (CNENASET = (1 << _CNENA_CNIEA5_POSITION))
#define EnableCNA4                 (CNENASET = (1 << _CNENA_CNIEA4_POSITION))
#define EnableCNA3                 (CNENASET = (1 << _CNENA_CNIEA3_POSITION))
#define EnableCNA2                 (CNENASET = (1 << _CNENA_CNIEA2_POSITION))
#define EnableCNA1                 (CNENASET = (1 << _CNENA_CNIEA1_POSITION))
#define EnableCNA0                 (CNENASET = (1 << _CNENA_CNIEA0_POSITION))

#define EnableCNB15                (CNENBSET = (1 << _CNENB_CNIEB15_POSITION))
#define EnableCNB14                (CNENBSET = (1 << _CNENB_CNIEB14_POSITION))
#define EnableCNB13                (CNENBSET = (1 << _CNENB_CNIEB13_POSITION))
#define EnableCNB12                (CNENBSET = (1 << _CNENB_CNIEB12_POSITION))
#define EnableCNB11                (CNENBSET = (1 << _CNENB_CNIEB11_POSITION))
#define EnableCNB10                (CNENBSET = (1 << _CNENB_CNIEB10_POSITION))
#define EnableCNB9                 (CNENBSET = (1 << _CNENB_CNIEB9_POSITION))
#define EnableCNB8                 (CNENBSET = (1 << _CNENB_CNIEB8_POSITION))
#define EnableCNB7                 (CNENBSET = (1 << _CNENB_CNIEB7_POSITION))
#define EnableCNB6                 (CNENBSET = (1 << _CNENB_CNIEB6_POSITION))
#define EnableCNB5                 (CNENBSET = (1 << _CNENB_CNIEB5_POSITION))
#define EnableCNB4                 (CNENBSET = (1 << _CNENB_CNIEB4_POSITION))
#define EnableCNB3                 (CNENBSET = (1 << _CNENB_CNIEB3_POSITION))
#define EnableCNB2                 (CNENBSET = (1 << _CNENB_CNIEB2_POSITION))
#define EnableCNB1                 (CNENBSET = (1 << _CNENB_CNIEB1_POSITION))
#define EnableCNB0                 (CNENBSET = (1 << _CNENB_CNIEB0_POSITION))

#define EnableCNC15                (CNENCSET = (1 << _CNENC_CNIEC15_POSITION))
#define EnableCNC14                (CNENCSET = (1 << _CNENC_CNIEC14_POSITION))
#define EnableCNC13                (CNENCSET = (1 << _CNENC_CNIEC13_POSITION))
#define EnableCNC12                (CNENCSET = (1 << _CNENC_CNIEC12_POSITION))
#define EnableCNC4                 (CNENCSET = (1 << _CNENC_CNIEC4_POSITION))
#define EnableCNC3                 (CNENCSET = (1 << _CNENC_CNIEC3_POSITION))
#define EnableCNC2                 (CNENCSET = (1 << _CNENC_CNIEC2_POSITION))
#define EnableCNC1                 (CNENCSET = (1 << _CNENC_CNIEC1_POSITION))

