biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#define EnableCND15                (CNENDSET = (1 << _CNEND_CNIED15_POSITION))
#define EnableCND14                (CNENDSET = (1 << _CNEND_CNIED14_POSITION))
#define EnableCND13                (CNENDSET = (1 << _CNEND_CNIED13_POSITION))
#define EnableCND12                (CNENDSET = (1 << _CNEND_CNIED12_POSITION))
#define EnableCND11                (CNENDSET = (1 << _CNEND_CNIED11_POSITION))
#define EnableCND10                (CNENDSET = (1 << _CNEND_CNIED10_POSITION))
#define EnableCND9                 (CNENDSET = (1 << _CNEND_CNIED9_POSITION))
#define EnableCND8                 (CNENDSET = (1 << _CNEND_CNIED8_POSITION))
#define EnableCND7                 (CNENDSET = (1 << _CNEND_CNIED7_POSITION))
#define EnableCND6                 (CNENDSET = (1 << _CNEND_CNIED6_POSITION))
#define EnableCND5                 (CNENDSET = (1 << _CNEND_CNIED5_POSITION))
#define EnableCND4                 (CNENDSET = (1 << _CNEND_CNIED4_POSITION))
#define EnableCND3                 (CNENDSET = (1 << _CNEND_CNIED3_POSITION))
#define EnableCND2                 (CNENDSET = (1 << _CNEND_CNIED2_POSITION))
#define EnableCND1                 (CNENDSET = (1 << _CNEND_CNIED1_POSITION))
#define EnableCND0                 (CNENDSET = (1 << _CNEND_CNIED0_POSITION))

#define EnableCNE9                 (CNENESET = (1 << _CNENE_CNIEE9_POSITION))
#define EnableCNE8                 (CNENESET = (1 << _CNENE_CNIEE8_POSITION))
#define EnableCNE7                 (CNENESET = (1 << _CNENE_CNIEE7_POSITION))
#define EnableCNE6                 (CNENESET = (1 << _CNENE_CNIEE6_POSITION))
#define EnableCNE5                 (CNENESET = (1 << _CNENE_CNIEE5_POSITION))
#define EnableCNE4                 (CNENESET = (1 << _CNENE_CNIEE4_POSITION))
#define EnableCNE3                 (CNENESET = (1 << _CNENE_CNIEE3_POSITION))
#define EnableCNE2                 (CNENESET = (1 << _CNENE_CNIEE2_POSITION))
#define EnableCNE1                 (CNENESET = (1 << _CNENE_CNIEE1_POSITION))
#define EnableCNE0                 (CNENESET = (1 << _CNENE_CNIEE0_POSITION))

#define EnableCNF13                (CNENFSET = (1 << _CNENF_CNIEF13_POSITION))
#define EnableCNF12                (CNENFSET = (1 << _CNENF_CNIEF12_POSITION))
#define EnableCNF8                 (CNENFSET = (1 << _CNENF_CNIEF8_POSITION))
#define EnableCNF7                 (CNENFSET = (1 << _CNENF_CNIEF7_POSITION))
#define EnableCNF6                 (CNENFSET = (1 << _CNENF_CNIEF6_POSITION))
#define EnableCNF5                 (CNENFSET = (1 << _CNENF_CNIEF5_POSITION))
#define EnableCNF4                 (CNENFSET = (1 << _CNENF_CNIEF4_POSITION))
#define EnableCNF3                 (CNENFSET = (1 << _CNENF_CNIEF3_POSITION))
#define EnableCNF2                 (CNENFSET = (1 << _CNENF_CNIEF2_POSITION))
#define EnableCNF1                 (CNENFSET = (1 << _CNENF_CNIEF1_POSITION))
#define EnableCNF0                 (CNENFSET = (1 << _CNENF_CNIEF0_POSITION))

#define EnableCNG9                 (CNENGSET = (1 << _CNENG_CNIEG9_POSITION))
#define EnableCNG8                 (CNENGSET = (1 << _CNENG_CNIEG8_POSITION))
#define EnableCNG7                 (CNENGSET = (1 << _CNENG_CNIEG7_POSITION))
#define EnableCNG6                 (CNENGSET = (1 << _CNENG_CNIEG6_POSITION))
#define EnableCNG3                 (CNENGSET = (1 << _CNENG_CNIEG3_POSITION))
#define EnableCNG2                 (CNENGSET = (1 << _CNENG_CNIEG2_POSITION))
#define EnableCNG1                 (CNENGSET = (1 << _CNENG_CNIEG1_POSITION))
#define EnableCNG0                 (CNENGSET = (1 << _CNENG_CNIEG0_POSITION))


#else
#define EnableCN21                  (CNENSET = (1 << _CNEN_CNEN21_POSITION))
#define EnableCN20                  (CNENSET = (1 << _CNEN_CNEN20_POSITION))
#define EnableCN19                  (CNENSET = (1 << _CNEN_CNEN19_POSITION))
#define EnableCN18                  (CNENSET = (1 << _CNEN_CNEN18_POSITION))
#define EnableCN17                  (CNENSET = (1 << _CNEN_CNEN17_POSITION))
#define EnableCN16                  (CNENSET = (1 << _CNEN_CNEN16_POSITION))
#define EnableCN15                  (CNENSET = (1 << _CNEN_CNEN15_POSITION))
#define EnableCN14                  (CNENSET = (1 << _CNEN_CNEN14_POSITION))
#define EnableCN13                  (CNENSET = (1 << _CNEN_CNEN13_POSITION))
#define EnableCN12                  (CNENSET = (1 << _CNEN_CNEN12_POSITION))
#define EnableCN11                  (CNENSET = (1 << _CNEN_CNEN11_POSITION))
#define EnableCN10                  (CNENSET = (1 << _CNEN_CNEN10_POSITION))
#define EnableCN9                   (CNENSET = (1 << _CNEN_CNEN9_POSITION))
#define EnableCN8                   (CNENSET = (1 << _CNEN_CNEN8_POSITION))
#define EnableCN7                   (CNENSET = (1 << _CNEN_CNEN7_POSITION))
#define EnableCN6                   (CNENSET = (1 << _CNEN_CNEN6_POSITION))
#define EnableCN5                   (CNENSET = (1 << _CNEN_CNEN5_POSITION))
#define EnableCN4                   (CNENSET = (1 << _CNEN_CNEN4_POSITION))
#define EnableCN3                   (CNENSET = (1 << _CNEN_CNEN3_POSITION))
#define EnableCN2                   (CNENSET = (1 << _CNEN_CNEN2_POSITION))
#define EnableCN1                   (CNENSET = (1 << _CNEN_CNEN1_POSITION))
#define EnableCN0                   (CNENSET = (1 << _CNEN_CNEN0_POSITION))

#endif

/******************************************************************************
 * <combinewith DisableCN0, DisableCN1, DisableCN2, DisableCN3, DisableCN4, DisableCN5,
 * DisableCN6, DisableCN7, DisableCN8, DisableCN9, DisableCN10, DisableCN11, DisableCN12,
 * DisableCN13, DisableCN14, DisableCN15, DisableCN16, DisableCN17, DisableCN18, DisableCN19,
 * DisableCN20, DisableCN_ALL>
 *
 * Change Notice Interrupt Control Function
 *
 * Function:        void DisableCNx(void)
 *
 * Description:     Disables individual Change Notice interrupt
 *
 * PreCondition:    None
 *
 * Inputs:          None
 *
 * Output:          None
 *
 * Example:         DisableCN0()
 *
 *****************************************************************************/
#if (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
#define DisableCNA10                (CNENACLR = (1 << _CNENA_CNIEA10_POSITION))
#define DisableCNA9                 (CNENACLR = (1 << _CNENA_CNIEA9_POSITION))
#define DisableCNA8                 (CNENACLR = (1 << _CNENA_CNIEA8_POSITION))
#define DisableCNA7                 (CNENACLR = (1 << _CNENA_CNIEA7_POSITION))
#define DisableCNA4                 (CNENACLR = (1 << _CNENA_CNIEA4_POSITION))
#define DisableCNA3                 (CNENACLR = (1 << _CNENA_CNIEA3_POSITION))
#define DisableCNA2                 (CNENACLR = (1 << _CNENA_CNIEA2_POSITION))
#define DisableCNA1                 (CNENACLR = (1 << _CNENA_CNIEA1_POSITION))
#define DisableCNA0                 (CNENACLR = (1 << _CNENA_CNIEA0_POSITION))
#define DisableCNA_ALL              (CNENACLR = (0xFFFF))
                                                      
#define DisableCNB15                (CNENBCLR = (1 << _CNENB_CNIEB15_POSITION))
#define DisableCNB14                (CNENBCLR = (1 << _CNENB_CNIEB14_POSITION))
#define DisableCNB13                (CNENBCLR = (1 << _CNENB_CNIEB13_POSITION))
#define DisableCNB12                (CNENBCLR = (1 << _CNENB_CNIEB12_POSITION)) 
#define DisableCNB11                (CNENBCLR = (1 << _CNENB_CNIEB11_POSITION)) 
#define DisableCNB10                (CNENBCLR = (1 << _CNENB_CNIEB10_POSITION))
#define DisableCNB9                 (CNENBCLR = (1 << _CNENB_CNIEB9_POSITION))
#define DisableCNB8                 (CNENBCLR = (1 << _CNENB_CNIEB8_POSITION))
#define DisableCNB7                 (CNENBCLR = (1 << _CNENB_CNIEB7_POSITION))
#define DisableCNB6                 (CNENBCLR = (1 << _CNENB_CNIEB6_POSITION))
#define DisableCNB5                 (CNENBCLR = (1 << _CNENB_CNIEB5_POSITION))
#define DisableCNB4                 (CNENBCLR = (1 << _CNENB_CNIEB4_POSITION))
#define DisableCNB3                 (CNENBCLR = (1 << _CNENB_CNIEB3_POSITION))
#define DisableCNB2                 (CNENBCLR = (1 << _CNENB_CNIEB2_POSITION))
#define DisableCNB1                 (CNENBCLR = (1 << _CNENB_CNIEB1_POSITION))
#define DisableCNB0                 (CNENBCLR = (1 << _CNENB_CNIEB0_POSITION))
#define DisableCNB_ALL              (CNENBCLR = (0xFFFF))
 
#define DisableCNC9                 (CNENCCLR = (1 << _CNENC_CNIEC9_POSITION))
#define DisableCNC8                 (CNENCCLR = (1 << _CNENC_CNIEC8_POSITION))
#define DisableCNC7                 (CNENCCLR = (1 << _CNENC_CNIEC7_POSITION))
#define DisableCNC6                 (CNENCCLR = (1 << _CNENC_CNIEC6_POSITION))
#define DisableCNC5                 (CNENCCLR = (1 << _CNENC_CNIEC5_POSITION))
#define DisableCNC4                 (CNENCCLR = (1 << _CNENC_CNIEC4_POSITION))
#define DisableCNC3                 (CNENCCLR = (1 << _CNENC_CNIEC3_POSITION))
#define DisableCNC2                 (CNENCCLR = (1 << _CNENC_CNIEC2_POSITION))
#define DisableCNC1                 (CNENCCLR = (1 << _CNENC_CNIEC1_POSITION))
#define DisableCNC0                 (CNENCCLR = (1 << _CNENC_CNIEC0_POSITION))
#define DisableCNC_ALL              (CNENCCLR = (0xFFFF))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
#define DisableCNA15                (CNENACLR = (1 << _CNENA_CNIEA15_POSITION))
#define DisableCNA14                (CNENACLR = (1 << _CNENA_CNIEA14_POSITION))
#define DisableCNA10                (CNENACLR = (1 << _CNENA_CNIEA10_POSITION))
#define DisableCNA9                 (CNENACLR = (1 << _CNENA_CNIEA9_POSITION))
#define DisableCNA7                 (CNENACLR = (1 << _CNENA_CNIEA7_POSITION))
#define DisableCNA6                 (CNENACLR = (1 << _CNENA_CNIEA6_POSITION))
#define DisableCNA5                 (CNENACLR = (1 << _CNENA_CNIEA5_POSITION))
#define DisableCNA4                 (CNENACLR = (1 << _CNENA_CNIEA4_POSITION))
#define DisableCNA3                 (CNENACLR = (1 << _CNENA_CNIEA3_POSITION))
#define DisableCNA2                 (CNENACLR = (1 << _CNENA_CNIEA2_POSITION))
#define DisableCNA1                 (CNENACLR = (1 << _CNENA_CNIEA1_POSITION))
#define DisableCNA0                 (CNENACLR = (1 << _CNENA_CNIEA0_POSITION))
#define DisableCNA_ALL              (CNENACLR = (0xFFFF))
                                                                           
#define DisableCNB15                (CNENBCLR = (1 << _CNENB_CNIEB15_POSITION))
#define DisableCNB14                (CNENBCLR = (1 << _CNENB_CNIEB14_POSITION))
#define DisableCNB13                (CNENBCLR = (1 << _CNENB_CNIEB13_POSITION))
#define DisableCNB12                (CNENBCLR = (1 << _CNENB_CNIEB12_POSITION)) 
#define DisableCNB11                (CNENBCLR = (1 << _CNENB_CNIEB11_POSITION)) 
#define DisableCNB10                (CNENBCLR = (1 << _CNENB_CNIEB10_POSITION))
#define DisableCNB9                 (CNENBCLR = (1 << _CNENB_CNIEB9_POSITION))
#define DisableCNB8                 (CNENBCLR = (1 << _CNENB_CNIEB8_POSITION))
#define DisableCNB7                 (CNENBCLR = (1 << _CNENB_CNIEB7_POSITION))
#define DisableCNB6                 (CNENBCLR = (1 << _CNENB_CNIEB6_POSITION))
#define DisableCNB5                 (CNENBCLR = (1 << _CNENB_CNIEB5_POSITION))
#define DisableCNB4                 (CNENBCLR = (1 << _CNENB_CNIEB4_POSITION))
#define DisableCNB3                 (CNENBCLR = (1 << _CNENB_CNIEB3_POSITION))
#define DisableCNB2                 (CNENBCLR = (1 << _CNENB_CNIEB2_POSITION))
#define DisableCNB1                 (CNENBCLR = (1 << _CNENB_CNIEB1_POSITION))
#define DisableCNB0                 (CNENBCLR = (1 << _CNENB_CNIEB0_POSITION))
#define DisableCNB_ALL              (CNENBCLR = (0xFFFF))
                                   
