biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#define DisableCNC15                (CNENCCLR = (1 << _CNENC_CNIEC15_POSITION))
#define DisableCNC14                (CNENCCLR = (1 << _CNENC_CNIEC14_POSITION))
#define DisableCNC13                (CNENCCLR = (1 << _CNENC_CNIEC13_POSITION))
#define DisableCNC12                (CNENCCLR = (1 << _CNENC_CNIEC12_POSITION))
#define DisableCNC4                 (CNENCCLR = (1 << _CNENC_CNIEC4_POSITION))
#define DisableCNC3                 (CNENCCLR = (1 << _CNENC_CNIEC3_POSITION))
#define DisableCNC2                 (CNENCCLR = (1 << _CNENC_CNIEC2_POSITION))
#define DisableCNC1                 (CNENCCLR = (1 << _CNENC_CNIEC1_POSITION))
#define DisableCNC_ALL              (CNENCCLR = (0xFFFF))

#define DisableCND15                (CNENDCLR = (1 << _CNEND_CNIED15_POSITION))
#define DisableCND14                (CNENDCLR = (1 << _CNEND_CNIED14_POSITION))
#define DisableCND13                (CNENDCLR = (1 << _CNEND_CNIED13_POSITION))
#define DisableCND12                (CNENDCLR = (1 << _CNEND_CNIED12_POSITION)) 
#define DisableCND11                (CNENDCLR = (1 << _CNEND_CNIED11_POSITION)) 
#define DisableCND10                (CNENDCLR = (1 << _CNEND_CNIED10_POSITION))
#define DisableCND9                 (CNENDCLR = (1 << _CNEND_CNIED9_POSITION))
#define DisableCND8                 (CNENDCLR = (1 << _CNEND_CNIED8_POSITION))
#define DisableCND7                 (CNENDCLR = (1 << _CNEND_CNIED7_POSITION))
#define DisableCND6                 (CNENDCLR = (1 << _CNEND_CNIED6_POSITION))
#define DisableCND5                 (CNENDCLR = (1 << _CNEND_CNIED5_POSITION))
#define DisableCND4                 (CNENDCLR = (1 << _CNEND_CNIED4_POSITION))
#define DisableCND3                 (CNENDCLR = (1 << _CNEND_CNIED3_POSITION))
#define DisableCND2                 (CNENDCLR = (1 << _CNEND_CNIED2_POSITION))
#define DisableCND1                 (CNENDCLR = (1 << _CNEND_CNIED1_POSITION))
#define DisableCND0                 (CNENDCLR = (1 << _CNEND_CNIED0_POSITION))
#define DisableCND_ALL              (CNENDCLR = (0xFFFF))

#define DisableCNE9                 (CNENECLR = (1 << _CNENE_CNIEE9_POSITION))
#define DisableCNE8                 (CNENECLR = (1 << _CNENE_CNIEE8_POSITION))
#define DisableCNE7                 (CNENECLR = (1 << _CNENE_CNIEE7_POSITION))
#define DisableCNE6                 (CNENECLR = (1 << _CNENE_CNIEE6_POSITION))
#define DisableCNE5                 (CNENECLR = (1 << _CNENE_CNIEE5_POSITION))
#define DisableCNE4                 (CNENECLR = (1 << _CNENE_CNIEE4_POSITION))
#define DisableCNE3                 (CNENECLR = (1 << _CNENE_CNIEE3_POSITION))
#define DisableCNE2                 (CNENECLR = (1 << _CNENE_CNIEE2_POSITION))
#define DisableCNE1                 (CNENECLR = (1 << _CNENE_CNIEE1_POSITION))
#define DisableCNE0                 (CNENECLR = (1 << _CNENE_CNIEE0_POSITION))
#define DisableCNE_ALL              (CNENECLR = (0xFFFF))

#define DisableCNF13                (CNENFCLR = (1 << _CNENF_CNIEF13_POSITION))
#define DisableCNF12                (CNENFCLR = (1 << _CNENF_CNIEF12_POSITION)) 
#define DisableCNF8                 (CNENFCLR = (1 << _CNENF_CNIEF8_POSITION))
#define DisableCNF7                 (CNENFCLR = (1 << _CNENF_CNIEF7_POSITION))
#define DisableCNF6                 (CNENFCLR = (1 << _CNENF_CNIEF6_POSITION))
#define DisableCNF5                 (CNENFCLR = (1 << _CNENF_CNIEF5_POSITION))
#define DisableCNF4                 (CNENFCLR = (1 << _CNENF_CNIEF4_POSITION))
#define DisableCNF3                 (CNENFCLR = (1 << _CNENF_CNIEF3_POSITION))
#define DisableCNF2                 (CNENFCLR = (1 << _CNENF_CNIEF2_POSITION))
#define DisableCNF1                 (CNENFCLR = (1 << _CNENF_CNIEF1_POSITION))
#define DisableCNF0                 (CNENFCLR = (1 << _CNENF_CNIEF0_POSITION))
#define DisableCNF_ALL              (CNENFCLR = (0xFFFF))

#define DisableCNG9                 (CNENGCLR = (1 << _CNENG_CNIEG9_POSITION))
#define DisableCNG8                 (CNENGCLR = (1 << _CNENG_CNIEG8_POSITION))
#define DisableCNG7                 (CNENGCLR = (1 << _CNENG_CNIEG7_POSITION))
#define DisableCNG6                 (CNENGCLR = (1 << _CNENG_CNIEG6_POSITION))
#define DisableCNG3                 (CNENGCLR = (1 << _CNENG_CNIEG3_POSITION))
#define DisableCNG2                 (CNENGCLR = (1 << _CNENG_CNIEG2_POSITION))
#define DisableCNG1                 (CNENGCLR = (1 << _CNENG_CNIEG1_POSITION))
#define DisableCNG0                 (CNENGCLR = (1 << _CNENG_CNIEG0_POSITION))
#define DisableCNG_ALL              (CNENGCLR = (0xFFFF))

#else
#define DisableCN21                 (CNENCLR = (1 << _CNEN_CNEN21_POSITION))
#define DisableCN20                 (CNENCLR = (1 << _CNEN_CNEN20_POSITION))
#define DisableCN19                 (CNENCLR = (1 << _CNEN_CNEN19_POSITION))
#define DisableCN18                 (CNENCLR = (1 << _CNEN_CNEN18_POSITION))
#define DisableCN17                 (CNENCLR = (1 << _CNEN_CNEN17_POSITION))
#define DisableCN16                 (CNENCLR = (1 << _CNEN_CNEN16_POSITION))
#define DisableCN15                 (CNENCLR = (1 << _CNEN_CNEN15_POSITION))
#define DisableCN14                 (CNENCLR = (1 << _CNEN_CNEN14_POSITION))
#define DisableCN13                 (CNENCLR = (1 << _CNEN_CNEN13_POSITION))
#define DisableCN12                 (CNENCLR = (1 << _CNEN_CNEN12_POSITION))
#define DisableCN11                 (CNENCLR = (1 << _CNEN_CNEN11_POSITION))
#define DisableCN10                 (CNENCLR = (1 << _CNEN_CNEN10_POSITION))
#define DisableCN9                  (CNENCLR = (1 << _CNEN_CNEN9_POSITION))
#define DisableCN8                  (CNENCLR = (1 << _CNEN_CNEN8_POSITION))
#define DisableCN7                  (CNENCLR = (1 << _CNEN_CNEN7_POSITION))
#define DisableCN6                  (CNENCLR = (1 << _CNEN_CNEN6_POSITION))
#define DisableCN5                  (CNENCLR = (1 << _CNEN_CNEN5_POSITION))
#define DisableCN4                  (CNENCLR = (1 << _CNEN_CNEN4_POSITION))
#define DisableCN3                  (CNENCLR = (1 << _CNEN_CNEN3_POSITION))
#define DisableCN2                  (CNENCLR = (1 << _CNEN_CNEN2_POSITION))
#define DisableCN1                  (CNENCLR = (1 << _CNEN_CNEN1_POSITION))
#define DisableCN0                  (CNENCLR = (1 << _CNEN_CNEN0_POSITION))
#define DisableCN_ALL               (CNENCLR = (0x3FFFFF))

#endif

