biomurph/chipKIT-core-prebuilt/MacOS core/chipkit-core/pic32/compiler/pic32-tools/pic32mx/include/peripheral/ports.h
#if defined _PORTA
#define mPORTADirection(_tris)              (TRISA = (unsigned int)(_tris))
#define mPORTAGetDirection()                (TRISA)
#define mPORTAReadDirectionBits(_bits)      (TRISA & (unsigned int)(_bits))

#define mPORTARead()                        (PORTA)
#define mPORTAReadBits(_bits)               (PORTA & (unsigned int)(_bits))
#define mPORTAReadLatch()                   (LATA)
#define mPORTAReadLatchBits(_bits)          (LATA & (unsigned int)(_bits))

#define mPORTAWrite(_lat)                   (LATA = (unsigned int)(_lat))
#define mPORTASetBits(_bits)                (LATASET = (unsigned int)(_bits))
#define mPORTAClearBits(_bits)              (LATACLR = (unsigned int)(_bits))
#define mPORTAToggleBits(_bits)             (LATAINV = (unsigned int)(_bits))

#define mPORTAOpenDrainOpen(_bits)          (ODCASET = (unsigned int)(_bits),\
                                             TRISACLR = (unsigned int)(_bits))
#define mPORTAOpenDrainClose(_bits)         (ODCACLR = (unsigned int)(_bits),\
                                             TRISASET = (unsigned int)(_bits))

#define mPORTACloseAll()                    (TRISASET = 0xFFFFFFFF,\
                                             LATACLR = 0xFFFFFFFF)
#define mPORTACloseBits(_bits)              (TRISASET = (unsigned int)(_bits),\
                                             LATACLR = (unsigned int)(_bits))


#if (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
	#define mPORTASetPinsAnalogOut(_outputs)    (TRISACLR = (unsigned int)(_outputs),\
												ANSELASET = (unsigned int)(_outputs))
	#define mPORTASetPinsAnalogIn(_inputs)      (TRISASET = (unsigned int)(_inputs),\
												ANSELASET = (unsigned int)(_inputs))
	#define mPORTASetPinsDigitalOut(_outputs)   (TRISACLR = (unsigned int)(_outputs),\
												ANSELACLR = (unsigned int)(_outputs))
	#define mPORTASetPinsDigitalIn(_inputs)     (TRISASET = (unsigned int)(_inputs),\
												ANSELACLR = (unsigned int)(_inputs))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
        #define mPORTASetPinsAnalogOut(_outputs)    (TRISACLR = (unsigned int)(_outputs),\
												ANSELASET = (unsigned int)(_outputs))
	#define mPORTASetPinsAnalogIn(_inputs)      (TRISASET = (unsigned int)(_inputs),\
												ANSELASET = (unsigned int)(_inputs))
	#define mPORTASetPinsDigitalOut(_outputs)   (TRISACLR = (unsigned int)(_outputs),\
												ANSELACLR = (unsigned int)(_outputs))
	#define mPORTASetPinsDigitalIn(_inputs)     (TRISASET = (unsigned int)(_inputs),\
												ANSELACLR = (unsigned int)(_inputs))

#else
	#define mPORTASetPinsDigitalIn(_inputs)     (TRISASET = (unsigned int)(_inputs))
	#define mPORTASetPinsDigitalOut(_outputs)   (TRISACLR = (unsigned int)(_outputs))

#endif

#endif  //end PORTA


#if defined _PORTB
/******************************************************************************
 * PORTB macros
 *****************************************************************************/
#define mPORTBDirection(_tris)              (TRISB = (unsigned int)(_tris))
#define mPORTBGetDirection()                (TRISB)
#define mPORTBReadDirectionBits(_bits)      (TRISB & (unsigned int)(_bits))

#define mPORTBRead()                        (PORTB)
#define mPORTBReadBits(_bits)               (PORTB & (unsigned int)(_bits))
#define mPORTBReadLatch()                   (LATB)
#define mPORTBReadLatchBits(_bits)          (LATB & (unsigned int)(_bits))

#define mPORTBWrite(_lat)                   (LATB = (unsigned int)(_lat))
#define mPORTBSetBits(_bits)                (LATBSET = (unsigned int)(_bits))
#define mPORTBClearBits(_bits)              (LATBCLR = (unsigned int)(_bits))
#define mPORTBToggleBits(_bits)             (LATBINV = (unsigned int)(_bits))

#define mPORTBOpenDrainOpen(_bits)          (ODCBSET = (unsigned int)(_bits),\
                                            TRISBCLR = (unsigned int)(_bits))
#define mPORTBOpenDrainClose(_bits)         (ODCBCLR = (unsigned int)(_bits),\
                                            TRISBSET = (unsigned int)(_bits))

#define mPORTBCloseAll()                    (TRISBSET = 0xFFFFFFFF,\
                                             LATBCLR = 0xFFFFFFFF)
#define mPORTBCloseBits(_bits)              (TRISBSET = (unsigned int)(_bits),\
                                            LATBCLR = (unsigned int)(_bits))

#if (((__PIC32_FEATURE_SET__ >= 100) && (__PIC32_FEATURE_SET__ <= 299)) || defined(__32MXGENERIC__))
	#define mPORTBSetPinsAnalogOut(_outputs)    (TRISBCLR = (unsigned int)(_outputs),\
												ANSELBSET = (unsigned int)(_outputs))
	#define mPORTBSetPinsAnalogIn(_inputs)      (TRISBSET = (unsigned int)(_inputs),\
												ANSELBSET = (unsigned int)(_inputs))
	#define mPORTBSetPinsDigitalOut(_outputs)   (TRISBCLR = (unsigned int)(_outputs),\
												ANSELBCLR= (unsigned int)(_outputs))
	#define mPORTBSetPinsDigitalIn(_inputs)     (TRISBSET = (unsigned int)(_inputs),\
												ANSELBCLR = (unsigned int)(_inputs))

#elif ((__PIC32_FEATURE_SET__ == 330) || (__PIC32_FEATURE_SET__ == 350) || (__PIC32_FEATURE_SET__ == 370) || (__PIC32_FEATURE_SET__ == 430) || (__PIC32_FEATURE_SET__ == 450) || (__PIC32_FEATURE_SET__ == 470))
        #define mPORTBSetPinsAnalogOut(_outputs)    (TRISBCLR = (unsigned int)(_outputs),\
												ANSELBSET = (unsigned int)(_outputs))
	#define mPORTBSetPinsAnalogIn(_inputs)      (TRISBSET = (unsigned int)(_inputs),\
												ANSELBSET = (unsigned int)(_inputs))
	#define mPORTBSetPinsDigitalOut(_outputs)   (TRISBCLR = (unsigned int)(_outputs),\
												ANSELBCLR= (unsigned int)(_outputs))
	#define mPORTBSetPinsDigitalIn(_inputs)     (TRISBSET = (unsigned int)(_inputs),\
												ANSELBCLR = (unsigned int)(_inputs))

#else
	#define mPORTBSetPinsAnalogOut(_outputs)    (TRISBCLR = (unsigned int)(_outputs),\
												AD1PCFGCLR = (unsigned int)(_outputs))
	#define mPORTBSetPinsAnalogIn(_inputs)      (TRISBSET = (unsigned int)(_inputs),\
												AD1PCFGCLR = (unsigned int)(_inputs))
	#define mPORTBSetPinsDigitalOut(_outputs)   (TRISBCLR = (unsigned int)(_outputs),\
												AD1PCFGSET = (unsigned int)(_outputs))
	#define mPORTBSetPinsDigitalIn(_inputs)     (TRISBSET = (unsigned int)(_inputs),\
												AD1PCFGSET = (unsigned int)(_inputs))
#endif

#endif  //end PORTB

